proxy/stress_tests/post.yml
config:
  target: 'http://localhost:3003'
  http:
    pool: 20
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 10
      name: "1 to 10 request per second"
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "10 to 100 request per second"
    - duration: 30
      arrivalRate: 100
      rampTo: 1000
      name: "100 to 1000 request per second"
scenarios:
  - name: "Post comments"
    flow:
      - post:
          url: "/support/9999/"
          json:
            username: "Hectron5000"
            comment: "This album is smooth, I love listening to this while I code."
            profileImg: "https://s3-us-west-1.amazonaws.com/hrr37-sdc-johnson-cody/SDC+Images/guest-user.jpeg"